# DATA WRANGLING

In [19]:
import os
import glob
import tqdm 

import matplotlib.pyplot as plt 
import seaborn as sns
sns.set(color_codes=True)


import pandas as pd
import numpy as np
from scipy import stats                
import math                            
import scipy.signal as signal             
import random

from pathlib import Path

In [13]:
os.getcwd()

'C:\\Users\\ville\\PycharmProjects\\stat_projetcs\\Appr_Stat\\code'

# 1/ Import of data

In [15]:
data_folder = Path(r"C:\Users\ville\PycharmProjects\stat_projetcs\Appr_Stat\data\Books_Dataset_20210108\archive")
bestsellers = data_folder / "bestsellers_with_categories.csv"
dta = pd.read_csv(bestsellers)

# 2/ Observations on data

In [20]:
dta.head(5)

,Name,Author,User Rating,Reviews,Price,Year,Genre
0,10-Day Green Smoothie Cleanse,JJ Smith,4.7,17350,8,2016,Non Fiction
1,11/22/63: A Novel,Stephen King,4.6,2052,22,2011,Fiction
2,12 Rules for Life: An Antidote to Chaos,Jordan B. Peterson,4.7,18979,15,2018,Non Fiction
3,1984 (Signet Classics),George Orwell,4.7,21424,6,2017,Fiction
4,"5,000 Awesome Facts (About Everything!) (Natio...",National Geographic Kids,4.8,7665,12,2019,Non Fiction

In [21]:
dta.tail(5)

,Name,Author,User Rating,Reviews,Price,Year,Genre
545,Wrecking Ball (Diary of a Wimpy Kid Book 14),Jeff Kinney,4.9,9413,8,2019,Fiction
546,You Are a Badass: How to Stop Doubting Your Gr...,Jen Sincero,4.7,14331,8,2016,Non Fiction
547,You Are a Badass: How to Stop Doubting Your Gr...,Jen Sincero,4.7,14331,8,2017,Non Fiction
548,You Are a Badass: How to Stop Doubting Your Gr...,Jen Sincero,4.7,14331,8,2018,Non Fiction
549,You Are a Badass: How to Stop Doubting Your Gr...,Jen Sincero,4.7,14331,8,2019,Non Fiction

## -- Note for tail

We can see the same movie with same rating, reviews and others. We can imagnine thats there are some doublons in the dataset 
We must treat this problem

In [17]:
dta.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 550 entries, 0 to 549
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Name         550 non-null    object
 1   Author       550 non-null    object
 2   User Rating  550 non-null    float64
 3   Reviews      550 non-null    int64
 4   Price        550 non-null    int64
 5   Year         550 non-null    int64
 6   Genre        550 non-null    object
dtypes: float64(1), int64(3), object(3)
memory usage: 30.2+ KB

## -- Base statistics

In [18]:
dta.describe().transpose()

,count,mean,std,min,25%,50%,75%,max
User Rating,550.0,4.618364,0.226980,3.3,4.5,4.7,4.80,4.9
Reviews,550.0,11953.281818,11731.132017,37.0,4058.0,8580.0,17253.25,87841.0
Price,550.0,13.100000,10.842262,0.0,7.0,11.0,16.00,105.0
Year,550.0,2014.000000,3.165156,2009.0,2011.0,2014.0,2017.00,2019.0

## -- Rename of needed column

In [28]:
dta = dta.rename(columns={"User Rating": "Rating"})
dta.columns

Index(['Name', 'Author', 'Rating', 'Reviews', 'Price', 'Year', 'Genre'], dtype='object')

## -- Look for Duplicated rows

In [32]:
dta.shape

(550, 7)

In [45]:
#isolation of duplicate rows
duplicate_rows = dta[dta.duplicated(subset=['Name'])]

#isolation of unique value 
name_values = dta["Name"].values
names_unique = np.unique(name_values)

In [56]:
dupli_name = dta["Name"].nunique()
dupli_name

351